---
kind: enumMember
id: F:Autodesk.Revit.DB.DimensionStyleType.LinearFixed
enum: Autodesk.Revit.DB.DimensionStyleType
source: html/130b0264-615d-610e-38e0-4ce2a8e2aecd.htm
---
# Autodesk.Revit.DB.DimensionStyleType.LinearFixed

LinearFixed dimension, which is linear dimension whose direction is parallel to X or Y.